{"class_name": "Sequential", "keras_version": "2.1.4", "config": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, null, 1], "name": "input_5", "sparse": false, "dtype": "float32"}}, {"class_name": "Conv2D", "config": {"filters": 64, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activation": "relu", "name": "conv2d_49", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"filters": 64, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activation": "relu", "name": "conv2d_50", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"filters": 128, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activation": "relu", "name": "conv2d_51", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"filters": 128, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activation": "relu", "name": "conv2d_52", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"filters": 256, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activation": "relu", "name": "conv2d_53", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"filters": 256, "strides": [2, 2], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activation": "relu", "name": "conv2d_54", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"filters": 512, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activation": "relu", "name": "conv2d_55", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"filters": 256, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activation": "relu", "name": "conv2d_56", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"filters": 128, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activation": "relu", "name": "conv2d_57", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_13", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"filters": 64, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activation": "relu", "name": "conv2d_58", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_14", "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"filters": 32, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activation": "relu", "name": "conv2d_59", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"filters": 2, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "bias_constraint": null, "activation": "tanh", "name": "conv2d_60", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null, "bias_regularizer": null, "use_bias": true}}, {"class_name": "UpSampling2D", "config": {"size": [2, 2], "trainable": true, "name": "up_sampling2d_15", "data_format": "channels_last"}}], "backend": "tensorflow"}